{"class_name": "Model", "config": {"name": "AVOModel", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 31, 61, 1], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "conv0", "class_name": "Conv2D", "config": {"name": "conv0", "trainable": true, "filters": 2, "kernel_size": [20, 20], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": 3}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "bn0", "class_name": "BatchNormalization", "config": {"name": "bn0", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"name": "max_pool0", "class_name": "MaxPooling2D", "config": {"name": "max_pool0", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "flatten_4", "class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pool0", 0, 0, {}]]]}, {"name": "fc", "class_name": "Dense", "config": {"name": "fc", "trainable": true, "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["fc", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["activation_4", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}